## Heroes Of Pymoli Data Analysis ##
* Trend 1: Number of male players exceeds the number of female players almost 5:1.(80%+ are males)
* Trend 2: Players int the age group of 15 to 30 years spend far more than the players in any other age group.
* Trend 3: Item ID 34 is the most profitable item, whereas Item ID 39 and 84 tied for the most purchased items.

In [647]:
# Import Dependencies
import pandas as pd
import numpy as np

In [648]:
# Import purchase_data.json as a DataFrame
purchase_df= pd.read_json('purchase_data.json')
purchase_df.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

### Player Count ###

In [649]:
# Total Number of Players
players= purchase_df["SN"].unique()
players_cnt = len(players)
players_cnt

573

In [650]:
# creating a Dataframe for Player Count
player_df = pd.DataFrame([{"Total Plyers":players_cnt}])
player_df

   Total Plyers
0           573

### #Purchasing Analysis (Total) ####

In [651]:
# To find :
# Number of Unique Items
# Average Purchase Price
# Total Number of Purchases
# Total Revenue

In [652]:
# Dropping Duplicates 
no_dup= purchase_df.drop_duplicates(["Item ID"], keep='last')
no_dup.head()

    Age  Gender  Item ID                         Item Name  Price           SN
17   22  Female       59     Lightning, Etcher of the King   1.65    Aenarap34
21   15    Male        3                      Phantomlight   1.79  Iaralrgue74
59   15    Male        2                           Verdict   3.40        Ila44
63   23    Male       28  Flux, Destroyer of Due Diligence   3.04    Ryanara76
88   23    Male      132                        Persuasion   3.90  Undotesta33

In [653]:
# Two wasys to count Number of Unique Items
# 1. Using count() 
unique_cnt=no_dup["Item ID"].count()

In [654]:
#Number of Unique Items
# 2.using unique()
num_unq_items = purchase_df["Item ID"].unique()
unique_items=len(num_unq_items)
unique_items

183

In [655]:
# Total Number of Purchases
# You can find this by using count() function on any column. I am doing it on "Item ID" here

total_pur = purchase_df["Item ID"].count()

In [656]:
# Total Revenue

total_rev = round(purchase_df["Price"].sum(),2)
total_rev

2286.33

In [657]:
#Average Purchase Price

avg_price = total_rev/total_pur
avg_price

2.9311923076923074

In [658]:
# Creating Purchse Analysis DataFrame to get a quick review

purchase_analysis_df = pd.DataFrame([{
    "Number of Unique Items": unique_items,
    "Average Purchase Price": round(avg_price,2),
    "Number of Purchases": total_pur,
    "Total Revenue": total_rev}],
columns = ["Number of Unique Items","Average Purchase Price","Number of Purchases","Total Revenue"])
# Adding "$" symbol

purchase_analysis_df.style.format({'Average Purchase Price': '${:.2f}', 'Total Revenue': '${:,.2f}'})

 ### Gender Demographics ###

In [659]:
# In this we are finding:

# Percentage and Count of Male Players
# Percentage and Count of Female Players
# Percentage and Count of Other / Non-Disclosed

In [660]:
# droping the duplicte names i.e SN
no_dup_players = purchase_df.drop_duplicates("SN")
no_dup_players.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [661]:
# Percentage and Count of Male Players
gender_cnt = no_dup_players['Gender'].value_counts().reset_index()
gender_cnt['% of Players'] = (gender_cnt['Gender']/players_cnt) * 100
gender_cnt.rename(columns = {'index': 'Gender', 'Gender': '# of Players'}, inplace = True)
gender_cnt.set_index(['Gender'], inplace = True)
gender_cnt.style.format({"% of Players": "{:.1f}%"})

### Purchasing Analysis (Gender) ###

In [662]:
# The below each broken by gender:

# Purchase Count
# Average Purchase Price
# Total Purchase Value
# Normalized Totals

In [663]:
# Purchase Count
gen_pur_cnt_df = pd.DataFrame(purchase_df.groupby("Gender")['Gender'].count())
gen_pur_cnt_df

                       Gender
Gender
Female                    136
Male                      633
Other / Non-Disclosed      11

In [664]:
# creating gender total df
gen_pur_total_df = pd.DataFrame(purchase_df.groupby('Gender')['Price'].sum())
gen_pur_total_df

                         Price
Gender
Female                  382.91
Male                   1867.68
Other / Non-Disclosed    35.74

In [665]:
# Merging two dataframes gen_pur_cnt_df and gen_pur_total_df 
gen_pur_combined = pd.merge(gen_pur_cnt_df,gen_pur_total_df,left_index = True, right_index = True)
gen_pur_combined

                       Gender    Price
Gender
Female                    136   382.91
Male                      633  1867.68
Other / Non-Disclosed      11    35.74

In [666]:
# renaming the columns
gen_pur_combined.rename(columns = {'Gender': '# of Purchases', 'Price':'Total Purchase Value'}, inplace=True)
gen_pur_combined

                       # of Purchases  Total Purchase Value
Gender
Female                            136                382.91
Male                              633               1867.68
Other / Non-Disclosed              11                 35.74

In [667]:
#adds column for average purchase price.

gen_pur_combined['Average Purchase Price'] = gen_pur_combined['Total Purchase Value']/gen_pur_combined['# of Purchases']
gen_pur_combined

,# of Purchases,Total Purchase Value,Average Purchase Price
Gender,,,
Female,136,382.91,2.815515
Male,633,1867.68,2.950521
Other / Non-Disclosed,11,35.74,3.249091

In [668]:
#merging gender counts into current df 
gen_pur_combined = gen_pur_combined.merge(gender_cnt, left_index = True, right_index = True)
gen_pur_combined

,# of Purchases,Total Purchase Value,Average Purchase Price,# of Players,% of Players
Gender,,,,,
Female,136,382.91,2.815515,100,17.452007
Male,633,1867.68,2.950521,465,81.151832
Other / Non-Disclosed,11,35.74,3.249091,8,1.396161

In [669]:
# calculating and adding normalized total
gen_pur_combined['Normalized Totals'] = gen_pur_combined['Total Purchase Value']/gen_pur_combined['# of Players']
gen_pur_combined

,# of Purchases,Total Purchase Value,Average Purchase Price,# of Players,% of Players,Normalized Totals
Gender,,,,,,
Female,136,382.91,2.815515,100,17.452007,3.829100
Male,633,1867.68,2.950521,465,81.151832,4.016516
Other / Non-Disclosed,11,35.74,3.249091,8,1.396161,4.467500

In [670]:
#deleting unwnted columns
del gen_pur_combined['% of Players']
del gen_pur_combined['# of Players']
gen_pur_combined

,# of Purchases,Total Purchase Value,Average Purchase Price,Normalized Totals
Gender,,,,
Female,136,382.91,2.815515,3.829100
Male,633,1867.68,2.950521,4.016516
Other / Non-Disclosed,11,35.74,3.249091,4.467500

In [671]:
# adding $ before the values
gen_pur_combined.style.format({'Total Purchase Value': '${:.2f}', 'Average Purchase Price': '${:.2f}', 'Normalized Totals': '${:.2f}'})

### Age Demographics ###

In [672]:
#The below each broken into bins of 4 years (i.e. <10, 10-14, 15-19, etc.)
#Purchase Count
#Average Purchase Price
#Total Purchase Value
#Normalized Totals

In [673]:
#creates a column 'age_bin' based on conditional of age range
purchase_df.loc[(purchase_df['Age'] < 10), 'age_bin'] = "< 10"
purchase_df.loc[(purchase_df['Age'] >= 10) & (purchase_df['Age'] <= 14), 'age_bin'] = "10 - 14"
purchase_df.loc[(purchase_df['Age'] >= 15) & (purchase_df['Age'] <= 19), 'age_bin'] = "15 - 19"
purchase_df.loc[(purchase_df['Age'] >= 20) & (purchase_df['Age'] <= 24), 'age_bin'] = "20 - 24"
purchase_df.loc[(purchase_df['Age'] >= 25) & (purchase_df['Age'] <= 29), 'age_bin'] = "25 - 29"
purchase_df.loc[(purchase_df['Age'] >= 30) & (purchase_df['Age'] <= 34), 'age_bin'] = "30 - 34"
purchase_df.loc[(purchase_df['Age'] >= 35) & (purchase_df['Age'] <= 39), 'age_bin'] = "35 - 39"
purchase_df.loc[(purchase_df['Age'] >= 40), 'age_bin'] = "> 40"
purchase_df.head()

,Age,Gender,Item ID,Item Name,Price,SN,age_bin
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,35 - 39
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,20 - 24
2,34,Male,174,Primitive Blade,2.46,Assastnya25,30 - 34
3,21,Male,92,Final Critic,1.36,Pheusrical25,20 - 24
4,23,Male,63,Stormfury Mace,1.27,Aela59,20 - 24

In [674]:
purchase_df[['age_bin', 'Age']].count()

age_bin    780
Age        780
dtype: int64

In [675]:
# purchase counts by age bin 
agebin_pur_cnt_df = pd.DataFrame(purchase_df.groupby('age_bin')['SN'].count())

In [676]:
#Average Purchase Price by age bin
agebin_avg_price_df = pd.DataFrame(purchase_df.groupby('age_bin')['Price'].mean())

In [677]:
#Total Purchase Value
agebin_total_purchse_df = pd.DataFrame(purchase_df.groupby('age_bin')['Price'].sum())

In [678]:
#Normalized Totals. For this we need to do the following data manipulations.

# 1 drop the duplicates and find the unique values
no_dup_agebin_df = pd.DataFrame(purchase_df.drop_duplicates('SN', keep = 'last').groupby('age_bin')['SN'].count())

In [679]:
#2 Merge the various dataframes
merge_agebin_df = pd.merge(agebin_pur_cnt_df, agebin_avg_price_df, left_index = True, right_index = True).merge(agebin_total_purchse_df, left_index = True, right_index = True).merge(no_dup_agebin_df, left_index = True, right_index = True)

In [680]:
# 3 renames columns to the meaningful names
merge_agebin_df.rename(columns = {"SN_x": "# of Purchases", "Price_x": "Average Purchase Price", "Price_y": "Total Purchase Value", "SN_y": "# of Purchasers"}, inplace = True)

In [681]:
# And now calculates normalized totals
merge_agebin_df['Normalized Totals'] = merge_agebin_df['Total Purchase Value']/merge_agebin_df['# of Purchasers']
merge_agebin_df

,# of Purchases,Average Purchase Price,Total Purchase Value,# of Purchasers,Normalized Totals
age_bin,,,,,
10 - 14,35,2.770000,96.95,23,4.215217
15 - 19,133,2.905414,386.42,100,3.864200
20 - 24,336,2.913006,978.77,259,3.779035
25 - 29,125,2.962640,370.33,87,4.256667
30 - 34,64,3.082031,197.25,47,4.196809
35 - 39,42,2.842857,119.40,27,4.422222
< 10,28,2.980714,83.46,19,4.392632
> 40,17,3.161765,53.75,11,4.886364

In [682]:
#resting the  index for 
merge_agebin_df.index.rename("Age", inplace = True)

In [683]:
# Styling and Formating the df
# formats
merge_agebin_df.style.format({'Average Purchase Price': '${:.2f}', 'Total Purchase Value': '${:.2f}', 'Normalized Totals': '${:.2f}'})
merge_agebin_df

,# of Purchases,Average Purchase Price,Total Purchase Value,# of Purchasers,Normalized Totals
Age,,,,,
10 - 14,35,2.770000,96.95,23,4.215217
15 - 19,133,2.905414,386.42,100,3.864200
20 - 24,336,2.913006,978.77,259,3.779035
25 - 29,125,2.962640,370.33,87,4.256667
30 - 34,64,3.082031,197.25,47,4.196809
35 - 39,42,2.842857,119.40,27,4.422222
< 10,28,2.980714,83.46,19,4.392632
> 40,17,3.161765,53.75,11,4.886364

### Top Spenders ###

In [684]:
## Identify the 5 most popular items by purchase count, then list (in a table):
# SN
# Purchase Count
# Average Purchase Price
# Total Purchase Value

In [685]:
#Identify the 5 most popular items by purchase count, then list (in a table):


# gets a count of each item by grouping by Item ID and counting the number of each IDs occurances
pop5_SN = pd.DataFrame(purchase_df.groupby('SN')['SN'].count())
#sort from high to low total purchase count
pop5_SN.sort_values('SN', ascending = False, inplace = True)
#keep the first 6 rows because there is a tie
pop5_SN = pop5_SN.iloc[0:6][:]

In [686]:
# gets a count of each item by grouping by Item ID and counting the number of each IDs occurances
pop5_SN = pd.DataFrame(purchase_df.groupby('Item ID')['Item ID'].count())
#sort from high to low total purchase count
pop5_SN.sort_values('Item ID', ascending = False, inplace = True)
#keep the first 6 rows because there is a tie
pop5_SN = pop5_SN.iloc[0:6][:]
#find the total purchase value of each item
pop5_items_total = pd.DataFrame(purchase_df.groupby('Item ID')['Price'].sum())
#merge purcahse count and total purcahse value 
pop5_items = pd.merge(pop5_SN, pop5_items_total, left_index = True, right_index = True)
#drop duplicate items from original Df
no_dup_items = purchase_df.drop_duplicates(['Item ID'], keep = 'last')
# merge to get all other info from the pop 6 using the no dup df
pop5_merge_ID = pd.merge(pop5_items, no_dup_items, left_index = True, right_on = 'Item ID')
#keep only neede columns
pop5_merge_ID = pop5_merge_ID[['Item ID', 'Item Name', 'Item ID_x', 'Price_y', 'Price_x']]
#reset index as item ID for aesthetics
pop5_merge_ID.set_index(['Item ID'], inplace = True)
# rename columns
pop5_merge_ID.rename(columns =  {'Item ID_x': 'Purchase Count', 'Price_y': 'Item Price', 'Price_x': 'Total Purchase Value'}, inplace=True)
#format
pop5_merge_ID.style.format({'Item Price': '${:.2f}', 'Total Purchase Value': '${:.2f}'})

In [687]:
del pop5_merge_ID["Item Name"]

### Most Popular Items ###

In [688]:
# Identify the 5 most popular items by purchase count, then list (in a table):
# Item ID
# Item Name
# Purchase Count
# Item Price
# Total Purchase Value

In [689]:
# Item ID
# grouping by Item ID and counting the number of each IDs 
top5_items_ID = pd.DataFrame(purchase_df.groupby('Item ID')['Item ID'].count())
#sort from high to low total purchase count
top5_items_ID.sort_values('Item ID', ascending = False, inplace = True)
top5_items_ID = top5_items_ID.iloc[0:6][:]

In [690]:
# Item Name
#find the total purchase value of each item
top5_items_total = pd.DataFrame(purchase_df.groupby('Item ID')['Price'].sum())

In [691]:
#merge purcahse count and total purcahse value 
top5_items = pd.merge(top5_items_ID, top5_items_total, left_index = True, right_index = True)

In [692]:
#drop duplicate items from original Df
no_dup_items = purchase_df.drop_duplicates(['Item ID'], keep = 'last')

In [693]:
# merge to get the info from the top 6 using the no dup df
top5_merge_ID = pd.merge(top5_items, no_dup_items, left_index = True, right_on = 'Item ID')
#keep only neede columns
top5_merge_ID = top5_merge_ID[['Item ID', 'Item Name', 'Item ID_x', 'Price_y', 'Price_x']]

In [694]:
#reset index as item ID 
top5_merge_ID.set_index(['Item ID'], inplace = True)
# rename columns
top5_merge_ID.rename(columns =  {'Item ID_x': 'Purchase Count', 'Price_y': 'Item Price', 'Price_x': 'Total Purchase Value'}, inplace=True)
#format
top5_merge_ID.style.format({'Item Price': '${:.2f}', 'Total Purchase Value': '${:.2f}'})

### Most Profitable Items ###

In [695]:
# Most Profitable Items

# Identify the 5 most profitable items by total purchase value, then list (in a table):
# Item ID
# Item Name
# Purchase Count
# Item Price
# Total Purchase Value

In [696]:
# Identify the 5 most profitable items by total purchase value, then list (in a table):

# find total purcahse value and sort by decending order
top5_profit = pd.DataFrame(purchase_df.groupby('Item ID')['Price'].sum())
top5_profit.sort_values('Price', ascending = False, inplace = True)
# Top 5
top5_profit = top5_profit.iloc[0:5][:]

In [697]:
#Item purchase count
pur_count_profit = pd.DataFrame(purchase_df.groupby('Item ID')['Item ID'].count())

In [698]:
#Merging
top5_profit = pd.merge(top5_profit, pur_count_profit, left_index = True, right_index = True, how = 'left')
top5_merge_profit = pd.merge(top5_profit, no_dup_items, left_index = True, right_on = 'Item ID', how = 'left')
top5_merge_profit = top5_merge_profit[['Item ID', 'Item Name', 'Item ID_x', 'Price_y','Price_x']]

In [699]:
#setting indes at Item IDtop5_merge_profit.set_index(['Item ID'], inplace=True)
top5_merge_profit.rename(columns = {'Item ID_x': 'Purchase Count', 'Price_y': 'Item Price', 'Price_x': 'Total Purchase Value'}, inplace = True)

#Styling and formating
top5_merge_profit.style.format({'Item Price': '${:.2f}', 'Total Purchase Value': '${:.2f}'})